Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СтатусыПрохожденияОбъектовСУО/СтатусыПрохожденияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПрохожденияОбъектовСУО</name>
  <enumValues>
    <name>Зачислен</name>
  </enumValues>
  <enumValues>
    <name>Проходит</name>
  </enumValues>
  <enumValues>
    <name>Завершил</name>
  </enumValues>
  <enumValues>
    <name>НеЗавершил</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Автомат</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
		И Объект.ПрограммаОбучения.ЭтоГруппа Тогда
		
		Отказ = Истина;
		Текст = НСтр("ru = 'Создание проведения программы обучения на основании группы не поддерживается'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено
		И ДанныеНастроек.Получить("ПоказыватьУдаленныеОбучения") <> Неопределено Тогда
		
		ПоказыватьУдаленныеОбучения = ДанныеНастроек.Получить("ПоказыватьУдаленныеОбучения");
			
	КонецЕсли;

	
	// Заполняем реквизиты
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ЗапросНаОбучение = Параметры.ЗапросНаОбучение;
		
		Если ЗначениеЗаполнено(Объект.ЗапросНаОбучение) Тогда
			
			ОбъектЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗапросНаОбучение, "ОбъектЗапроса");
			
			Если ТипЗнч(ОбъектЗапроса) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
				Объект.ПрограммаОбучения = ОбъектЗапроса;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Участники.Параметры.УстановитьЗначениеПараметра("УдаленИзПрограммы", НСтр("ru = 'Удален'"));
	Участники.Параметры.УстановитьЗначениеПараметра("НеАктивный", НСтр("ru = 'В ожидании проведения'"));
	Участники.Параметры.УстановитьЗначениеПараметра("Завершил", НСтр("ru = 'Завершил'"));
	Участники.Параметры.УстановитьЗначениеПараметра("НеЗавершил", НСтр("ru = 'Не завершил'"));
	Участники.Параметры.УстановитьЗначениеПараметра("Проходит", НСтр("ru = 'Проходит'"));
	Участники.Параметры.УстановитьЗначениеПараметра("Новое", НСтр("ru = 'Новый'"));
	Участники.Параметры.УстановитьЗначениеПараметра("Автомат", НСтр("ru = 'Автомат'"));
	Участники.Параметры.УстановитьЗначениеПараметра("НеДопущен", НСтр("ru = 'Не допущен'"));
	
	Если ЗначениеЗаполнено(Объект.НаименованиеДляУчастника) Тогда
		НаименованиеДляУчастника = Объект.НаименованиеДляУчастника;
	Иначе
		НаименованиеДляУчастника = Объект.Наименование;
	КонецЕсли;
	
	СформироватьСписокОбучений();
	
	// Устанавливаем доступность элементов
	
	УстановитьДоступностьЭлементовФормы();
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
	// Блокируем форму
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьРеквизитыНаименования();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.БезСценария Тогда

			Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
				
				Текст = НСтр("ru = 'Укажите наименование программы обучения'");
				Поле = "Наименование";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,, Поле, "Объект", Отказ);			
				
				Возврат;
				
			КонецЕсли;			
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(Объект.ПрограммаОбучения) Тогда
				
				Текст = НСтр("ru = 'Укажите программу обучения'");
				Поле = "ПрограммаОбучения";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,, Поле, "Объект", Отказ);			
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновлятьПодчиненныеДокументы = Истина;
	
	Если НЕ Объект.Проведен 
		И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		// Если выполняется любая запись непроведенного документа,
		// то подчиненные документы не обновляем.
		ОбновлятьПодчиненныеДокументы = Ложь;
		
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновлятьПодчиненныеДокументы", ОбновлятьПодчиненныеДокументы);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоИнтерактивнаяЗапись", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	ПорядковыйНомер = 1;
		
	Для каждого СтрокаПО Из ПроведенияОбучения Цикл
	
		ПроведениеОбученияОбъект = СтрокаПО.ПроведениеОбучения.ПолучитьОбъект();
		ПроведениеОбученияОбъект.ПорядковыйНомер = ПорядковыйНомер;
		ПроведениеОбученияОбъект.ОбменДанными.Загрузка = Истина;
		ПроведениеОбученияОбъект.Записать();
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект)
	
	СформироватьСписокОбучений();
	
	УстановитьДоступностьЭлементовФормы();
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);	
		
	// Запускаем регламентные задания вручную, не дожидаясь срабатывания расписания
	
	ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ПерепроведениеДокументовСУО");
	
	Если ВебКабинетСУ.Используется() Тогда
		ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ОбновлениеДанныхВебКабинетаСУ");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗапуститьОбновлениеДанныхУчастников();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОткрытаяПрограммаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)		
	УстановитьРеквизитыНаименования();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДляУчастникаПриИзменении(Элемент)
	Объект.НаименованиеДляУчастника = НаименованиеДляУчастника;	
	УстановитьРеквизитыНаименования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроведенияОбучения

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ПроведенияОбучения

&НаКлиенте
Процедура ПроведенияОбученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.ПроведениеОбучения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроведенияОбученияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	КопируемоеПроведениеОбучения = Неопределено;
	Если Копирование Тогда
		ТекущиеДанные = Элементы.ПроведенияОбучения.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		КопируемоеПроведениеОбучения = ТекущиеДанные.ПроведениеОбучения;
	КонецЕсли;
	
	СоздатьСкопироватьПроведениеОбучения(КопируемоеПроведениеОбучения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроведенияОбученияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	Если Элемент.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	МассивПроведенийОбучений = Новый Массив;
	ЕстьПомеченныеНаУдаление = Ложь;
	Для каждого ИндексСтроки Из Элемент.ВыделенныеСтроки Цикл
		СтрокаТПО = ПроведенияОбучения.НайтиПоИдентификатору(ИндексСтроки);
		МассивПроведенийОбучений.Добавить(СтрокаТПО.ПроведениеОбучения);
		Если СтрокаТПО.ПометкаУдаления Тогда
			ЕстьПомеченныеНаУдаление = Истина;	
		КонецЕсли;
	КонецЦикла;
	Если МассивПроведенийОбучений.Количество() > 0 Тогда
		УдалитьОбучения(МассивПроведенийОбучений, ЕстьПомеченныеНаУдаление);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроведенияОбученияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СформироватьСписокОбучений();
КонецПроцедуры

&НаКлиенте
Процедура ПроведенияОбученияОбработкаЗапросаОбновления()
	СформироватьСписокОбучений();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленныеОбученияПриИзменении(Элемент)
	СформироватьСписокОбучений();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Участники

&НаКлиенте
Процедура УчастникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Пользователь);

КонецПроцедуры

&НаКлиенте
Процедура УчастникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыбранныеУчастники = Неопределено;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда				
		ВыбранныеУчастники = Новый Массив;		
		ВыбранныеУчастники.Добавить(ВыбранноеЗначение);
	Иначе
		ВыбранныеУчастники = ВыбранноеЗначение;
	КонецЕсли;
	
	
	Если ТипЗнч(ВыбранныеУчастники) <> Тип("Массив") 
		ИЛИ ВыбранныеУчастники.Количество() = 0
		ИЛИ ТипЗнч(ВыбранныеУчастники[0]) <> Тип("СправочникСсылка.Пользователи") Тогда		
		Возврат;		
	КонецЕсли;
	
	ДанныеОбОбученияхВыбранныхУчастников = ДанныеОбОбученияхВыбранныхУчастников(Объект.Ссылка, ВыбранныеУчастники);
	
	ДанныеОбУдаленных = ДанныеОбОбученияхВыбранныхУчастников.ДанныеОбУдаленных;
	Если ДанныеОбУдаленных.ПрохожденияПрограммы.Количество() > 0 ИЛИ ДанныеОбУдаленных.ПрохожденияОбучений.Количество() > 0 Тогда
		Если ДанныеОбУдаленных.ПрохожденияПрограммы.Количество() > 0 И ДанныеОбУдаленных.ПрохожденияОбучений.Количество() = 0 Тогда
			ТекстВопроса = НСтр("ru = 'Среди зачисляемых участников есть ранее удаленные из программы обучения. Выберите действие для них:'");
		ИначеЕсли ДанныеОбУдаленных.ПрохожденияПрограммы.Количество() = 0 И ДанныеОбУдаленных.ПрохожденияОбучений.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Среди зачисляемых участников есть ранее удаленные из обучений программы. Выберите действие для них:'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Среди зачисляемых участников есть ранее удаленные из программы обучения и ее обучений. Выберите действие для них:'");
		КонецЕсли;			
		УдаленныеПрохождения = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УдаленныеПрохождения, ДанныеОбУдаленных.ПрохожденияПрограммы); 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УдаленныеПрохождения, ДанныеОбУдаленных.ПрохожденияОбучений); 
		ДополнительныеПараметры = Новый Структура("ВыбранныеУчастники, УдаленныеПрохождения, ПроведенияОбучения",
			ВыбранныеУчастники, УдаленныеПрохождения, ДанныеОбУдаленных.ПроведенияОбучения);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗачислитьУчастниковПослеВыбораДействияНадУдаленными", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Восстановить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Оставить удаленными'"));
		Если ДанныеОбУдаленных.ПрохожденияОбучений.Количество() > 0 Тогда
			Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть обучения для правки'"));
		КонецЕсли;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, НСтр("ru = 'Выбор действия для удаленных участников'"));
	Иначе
		ЗачислитьУчастников(Объект.Ссылка, ВыбранныеУчастники);	
	КонецЕсли;
	
	ДанныеОЗавершившихОбучения = ДанныеОбОбученияхВыбранныхУчастников.ДанныеОЗавершившихОбучения;
	Если ДанныеОЗавершившихОбучения.ЗавершенныеОбучения.Количество() > 0 Тогда
		Для каждого ДанныеОЗавершенномОбучении Из ДанныеОЗавершившихОбучения.ЗавершенныеОбучения Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 уже окончил(а) обучение ""%2""'"), ДанныеОЗавершенномОбучении.Пользователь, ДанныеОЗавершенномОбучении.ПроведениеОбучения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачислитьУчастниковПослеВыбораДействияНадУдаленными(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		ЗачислитьУчастников(Объект.Ссылка, ДополнительныеПараметры.ВыбранныеУчастники, ДополнительныеПараметры.УдаленныеПрохождения);
		Возврат;
	КонецЕсли;
	
	Если РезультатОтвета = КодВозвратаДиалога.Нет Тогда
		ЗачислитьУчастников(Объект.Ссылка, ДополнительныеПараметры.ВыбранныеУчастники);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ПроведенияОбучения.Количество() > 0 Тогда
		Для каждого ПроведениеОбучения Из ДополнительныеПараметры.ПроведенияОбучения Цикл
			ПоказатьЗначение(,ПроведениеОбучения);		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьПериодЗаписи(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.ДатаОткрытияЗаписи;
	Диалог.Период.ДатаОкончания = Объект.ДатаЗакрытияЗаписи;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПериодЗаписиПродолжение", ЭтотОбъект);		
		
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗаписиПродолжение(Период, ДополнительныеПараметры) Экспорт
	Объект.ДатаОткрытияЗаписи = Период.ДатаНачала;
	Объект.ДатаЗакрытияЗаписи = Период.ДатаОкончания;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСписокПроведенийМероприятий(Команда)
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
		ЗаполнитьПрохожденияПодчиненныхМероприятий(Объект.Ссылка);
		СформироватьСписокОбучений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокМероприятий" Тогда
		СформироватьСписокОбучений();
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСписокПрограммОбучения"
		И Источник <> ЭтотОбъект Тогда
		УстановитьДоступностьЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодПроведения(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.ДатаНачалаПроведения;
	Диалог.Период.ДатаОкончания = Объект.ДатаОкончанияПроведения;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПериодПроведенияПродолжение", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодПроведенияПродолжение(Период, ДополнительныеПараметры) Экспорт
	Объект.ДатаНачалаПроведения    = Период.ДатаНачала;
	Объект.ДатаОкончанияПроведения = Период.ДатаОкончания;
КонецПроцедуры	

&НаКлиенте
Процедура ПодобратьУчастников(Команда)
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
	
		АдресСпискаВХранилище = ПоместитьСписокУчастниковВХранилище();
		
		ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
		ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Участники);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаЗавершил(Команда)
	УстановитьСтатусПрохождения("Завершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаНеЗавершил(Команда)
	УстановитьСтатусПрохождения("НеЗавершил");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусУчастникаПроходит(Команда)
	УстановитьСтатусПрохождения("Проходит");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрохождения(Команда)
	ОбновитьПрохожденияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПроведенияОбучения(Команда)
	СформироватьСписокОбучений();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Общее

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Переменные и отборы списков
	//
		
	// Команды
	
	Элементы.ФормаЗаписать.Доступность = НЕ Объект.Проведен;
	
	// Обучения
	
	Элементы.КомандаЗаполнитьСписокПроведенийОбучения.Видимость = НЕ Объект.БезСценария;
	
	// Участники
	
	КоличествоУчастников = Документы.ПроведениеПрограммыОбученияСУО.КоличествоУчастниковПрограммыОбучения(Объект.Ссылка);	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Участники, Объект.Ссылка, "ПроведениеПрограммыОбучения");
	
	// Требуется заявка
	
	Если НЕ Объект.ОткрытаяПрограмма Тогда
		Объект.ТребуетсяЗаявка = Ложь;
	КонецЕсли;
		
	// Доступность и видимость элементов формы
	//
	
	Элементы.ПрограммаОбучения.Видимость = НЕ Объект.БезСценария;
	Элементы.ТребуетсяЗаявка.Доступность = Объект.ОткрытаяПрограмма;
	Элементы.ГруппаПериодЗаписи.Видимость = Объект.ОткрытаяПрограмма;
	Элементы.ГруппаПотенциальныеУчастники.Видимость = Объект.ОткрытаяПрограмма;
	
	
	// Все команды
	
	Если ТолькоПросмотр Тогда
		// Делаем недоступными все элементы
		Для Каждого ТекущийЭлементФормы Из Элементы Цикл
			Если ТипЗнч(ТекущийЭлементФормы) = Тип("КнопкаФормы")
				И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Отчет'")) = 0
				И Найти(ТекущийЭлементФормы.Имя, НСтр("ru = 'Заметку'")) = 0 Тогда
				ТекущийЭлементФормы.Доступность = Ложь;
			КонецЕсли;			
			Если ТипЗнч(ТекущийЭлементФормы) = Тип("ГруппаФормы") Тогда
				ТекущийЭлементФормы.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	Если ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект) Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

// Наименование

&НаКлиенте
Процедура УстановитьРеквизитыНаименования()
	
	Если Объект.Наименование = НаименованиеДляУчастника Тогда
		Объект.НаименованиеДляУчастника = "";			
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеДляУчастника) Тогда
		НаименованиеДляУчастника = Объект.Наименование;	
	КонецЕсли;
		
КонецПроцедуры

// Проведения обучения

&НаСервере
Процедура СформироватьСписокОбучений()
	
	ПроведенияОбучения.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПроведенийОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(Объект.Ссылка, ПоказыватьУдаленныеОбучения);
		
	Для каждого СтрокаТПО Из ТаблицаПроведенийОбучения Цикл
		
		Если НЕ ПоказыватьУдаленныеОбучения 
			И СтрокаТПО.Статус = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПроведенияОбучения.Добавить();
		НоваяСтрока.ПроведениеОбучения = СтрокаТПО.Ссылка;
		НоваяСтрока.Вид = СтрокаТПО.Вид;
	    НоваяСтрока.Статус = СтрокаТПО.Статус;
		Если ЗначениеЗаполнено(СтрокаТПО.ДатаНачалаОбучения) Тогда
			НоваяСтрока.НачалоОбучения = Формат(СтрокаТПО.ДатаНачалаОбучения, "ДЛФ=D") + " " + Формат(СтрокаТПО.ВремяНачалаОбучения, "ДЛФ=T");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТПО.ДатаОкончанияОбучения) Тогда
			НоваяСтрока.ОкончаниеОбучения = Формат(СтрокаТПО.ДатаОкончанияОбучения, "ДЛФ=D") + " " + Формат(СтрокаТПО.ВремяОкончанияОбучения, "ДЛФ=T");
		КонецЕсли;
		НоваяСтрока.АктивироватьАвтоматически = СтрокаТПО.АктивироватьАвтоматически;
		НоваяСтрока.Проведен = СтрокаТПО.Проведен;
		НоваяСтрока.Наименование = СтрокаТПО.Наименование;		
		НоваяСтрока.ПометкаУдаления = СтрокаТПО.ПометкаУдаления;
		
		Если СтрокаТПО.Проведен Тогда
			НоваяСтрока.НомерКартинки = 1;
		Иначе
			Если НоваяСтрока.ПометкаУдаления Тогда
				НоваяСтрока.НомерКартинки = 3;
			Иначе
				НоваяСтрока.НомерКартинки = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСкопироватьПроведениеОбучения(КопируемоеПроведениеОбучения = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("ПроведениеПрограммыОбучения", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(КопируемоеПроведениеОбучения) Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", КопируемоеПроведениеОбучения);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.Форма.ФормаДокумента", ПараметрыФормы, Элементы.ПроведенияОбучения);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбучения(МассивПроведенийОбучения, ЕстьПомеченныеНаУдаление)

	Если ЕстьПомеченныеНаУдаление Тогда
		Если МассивПроведенийОбучения.Количество() = 1 Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Снять пометку на удаление с ""%1""?'"), Строка(МассивПроведенийОбучения[0]));
		Иначе
			ТекстВопроса = НСтр("ru = 'Снять пометку на удаление с выделенных проведений обучения?'");
		КонецЕсли;		
	Иначе		
		Если МассивПроведенийОбучения.Количество() = 1 Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Пометить ""%1"" на удаление?'"), Строка(МассивПроведенийОбучения[0]));
		Иначе
			ТекстВопроса = НСтр("ru = 'Пометить на удаление выделенные проведения обучения?'");
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыУдаления = Новый Структура("МассивПроведенийОбучения, ЕстьПомеченныеНаУдаление", МассивПроведенийОбучения, ЕстьПомеченныеНаУдаление);
	
	Оповещение = Новый ОписаниеОповещения("УдалитьОбученияПродолжение", ЭтотОбъект, ПараметрыУдаления);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбученияПродолжение(Результат, ПараметрыУдаления) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
       УдалитьОбучениеНаСервере(ПараметрыУдаления.МассивПроведенийОбучения, НЕ ПараметрыУдаления.ЕстьПомеченныеНаУдаление);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьОбучениеНаСервере(Знач МассивПроведенийОбучения, Знач ПометкаУдаления)

	НачатьТранзакцию();
	
	Попытка
		
		Для каждого ПроведениеОбучения Из МассивПроведенийОбучения Цикл		
			ПроведениеОбученияОбъект = ПроведениеОбучения.ПолучитьОбъект();
			Если ПроведениеОбученияОбъект.ПометкаУдаления = ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			ПроведениеОбученияОбъект.УстановитьПометкуУдаления(ПометкаУдаления);		
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	СформироватьСписокОбучений();
	
КонецПроцедуры

// Подчиненные мероприятия

&НаСервереБезКонтекста
Процедура ЗаполнитьПрохожденияПодчиненныхМероприятий(ПроведениеПрограммыОбучения)	
	Документы.ПроведениеПрограммыОбученияСУО.ЗаполнитьПрохожденияПодчиненныхМероприятий(ПроведениеПрограммыОбучения);	
КонецПроцедуры

// Участники

&НаКлиенте
Процедура ЗапуститьОбновлениеДанныхУчастников()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Элементы.УчастникиСтатусПрохождения.Заголовок = НСтр("ru = 'Статус (обновляется)'");
	Элементы.УчастникиСтатусПрохождения.ЦветФонаЗаголовка = Новый Цвет(250, 204, 31);
	ПодключитьОбработчикОжидания("Подключаемый_ИдетОбновлениеДанныхУчастников", 2, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИдетОбновлениеДанныхУчастников()
	Если ЕстьДанныеУчастниковДляОбновления(Объект.Ссылка) Тогда
		Элементы.УчастникиСтатусПрохождения.Заголовок = НСтр("ru = 'Статус (обновляется)'");
		Элементы.УчастникиСтатусПрохождения.ЦветФонаЗаголовка = Новый Цвет(250, 204, 31);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ИдетОбновлениеДанныхУчастников");
		Элементы.УчастникиСтатусПрохождения.Заголовок = НСтр("ru = 'Статус'");		
		Элементы.УчастникиСтатусПрохождения.ЦветФонаЗаголовка = Новый Цвет();
		Элементы.Участники.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДанныеУчастниковДляОбновления(Знач ПроведениеПрограммыОбучения)
	Возврат РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ЕстьДокументыВладельца(ПроведениеПрограммыОбучения);
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеОбОбученияхВыбранныхУчастников(Знач ПроведениеПрограммыОбучения, Знач МассивПользователей)	
	
	// Удаленные
	
	УдаленныеПрохожденияПрограммы = Документы.ПроведениеПрограммыОбученияСУО.
		ПрохожденияПрограммыОбучения(ПроведениеПрограммыОбучения, Истина, МассивПользователей).ВыгрузитьКолонку("Прохождение");
		
	ВсеПроведенияОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(ПроведениеПрограммыОбучения).ВыгрузитьКолонку("ПроведениеОбучения");
	ТаблицаУдаленныхПрохожденийОбучений = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(ВсеПроведенияОбучения, Истина, Истина, МассивПользователей);
	УдаленныеПрохожденияОбучений = ТаблицаУдаленныхПрохожденийОбучений.ВыгрузитьКолонку("Прохождение");
	ТаблицаУдаленныхПрохожденийОбучений.Свернуть("ПроведениеОбучения");
	ПроведенияОбученияСУдаленнымиУчастниками = ТаблицаУдаленныхПрохожденийОбучений.ВыгрузитьКолонку("ПроведениеОбучения");	
	
	ДанныеОбУдаленных = Новый Структура("ПрохожденияПрограммы, ПроведенияОбучения, ПрохожденияОбучений",
		УдаленныеПрохожденияПрограммы, ПроведенияОбученияСУдаленнымиУчастниками, УдаленныеПрохожденияОбучений);
		
	// Завершенные
	
	ВсеПрохожденияПрограммы = Документы.ПроведениеПрограммыОбученияСУО.ПрохожденияПрограммыОбучения(ПроведениеПрограммыОбучения, Ложь, МассивПользователей); 
	НовыеПользователи = Новый Массив;
	Для каждого Пользователь Из МассивПользователей Цикл
		СтрокаТВП = ВсеПрохожденияПрограммы.Найти(Пользователь, "Пользователь"); 
		Если СтрокаТВП = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СтрокаТВП.Прохождение) Тогда
			НовыеПользователи.Добавить(Пользователь);
		КонецЕсли;
	КонецЦикла;	
	ТаблицаЗавершенныхПрохожденийОбучений = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(ВсеПроведенияОбучения, Ложь, Ложь, НовыеПользователи, Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил);
	МассивЗавершенныхОбучений = Новый Массив;
	Для каждого СтрокаЗПО Из ТаблицаЗавершенныхПрохожденийОбучений Цикл
		МассивЗавершенныхОбучений.Добавить(
			Новый Структура("Пользователь, ПроведениеОбучения", СтрокаЗПО.Пользователь, СтрокаЗПО.ПроведениеОбучения));	
	КонецЦикла;
	ДанныеОЗавершившихОбучения = Новый Структура("ЗавершенныеОбучения", МассивЗавершенныхОбучений);
	
	Возврат Новый Структура("ДанныеОбУдаленных, ДанныеОЗавершившихОбучения", ДанныеОбУдаленных, ДанныеОЗавершившихОбучения);
		
КонецФункции

&НаСервере
Процедура ЗачислитьУчастников(ПроведениеПрограммыОбучения, СписокПользователей, ПрохожденияДляСнятияУдаления = Неопределено) 
	
	Если СписокПользователей = Неопределено ИЛИ ПроведениеПрограммыОбучения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СписокПользователей) = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = СписокПользователей;
		СписокПользователей = Новый Массив();
		СписокПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Если ТипЗнч(СписокПользователей) = Тип("РегистрСведенийКлючЗаписи.СотрудникиСУО") Тогда
		Пользователь = СписокПользователей.Пользователь;
		СписокПользователей = Новый Массив();
		СписокПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Если ТипЗнч(СписокПользователей) <> Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'Тип параметра ""Список пользователей"" определен неверно. Действие отменено.'");
	КонецЕсли;
	
	УправлениеОбучениемСУО.ЗаблокироватьДанныеФормы(ЭтотОбъект);
	
	НачатьТранзакцию();
	
	Попытка
		
		// Снимаем удаление с переданных прохождений
		
		Если ПрохожденияДляСнятияУдаления <> Неопределено Тогда
			Для каждого ПрохождениеОбучения Из ПрохожденияДляСнятияУдаления Цикл			
				ПрохождениеОбученияОбъект = ПрохождениеОбучения.ПолучитьОбъект();
				ПрохождениеОбученияОбъект.ПометкаУдаления = Ложь;
				ПрохождениеОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;			
		КонецЕсли;			
		
		// Зачисляем
		
		Для каждого Пользователь Из СписокПользователей Цикл
			УправлениеОбучениемСУО.ЗачислитьУчастникаНаПрограммуОбучения(ПроведениеПрограммыОбучения, Пользователь,,,,,Истина);
		КонецЦикла;

		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;	
	
	КоличествоУчастников = Документы.ПроведениеПрограммыОбученияСУО.КоличествоУчастниковПрограммыОбучения(ПроведениеПрограммыОбучения);
	
	Элементы.Участники.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокУчастниковВХранилище()
	
	ТаблицаУчастников = Документы.ПроведениеПрограммыОбученияСУО.ПрохожденияПрограммыОбучения(Объект.Ссылка, Ложь);
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ТаблицаУчастников, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьСтатусПрохождения(Статус)
	
	ТекущиеДанные = Элементы.Участники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбучениеСУО.ПриПрохожденииПрограммыОбучения(ТекущиеДанные.Ссылка, Статус);
	
	Элементы.Участники.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПрохожденияНаСервере()
	
	Прохождения = Документы.ПроведениеПрограммыОбученияСУО.ПрохожденияПрограммыОбучения(Объект.Ссылка);
	
	Для каждого Строка Из Прохождения Цикл
		
		Если Строка.Проведен Тогда
			ОбучениеСУО.ПриПрохожденииПрограммыОбучения(Строка.Прохождение);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
